Revit 2024 API
PointRelativeToPoint.GetHostPointReference Method
Get a copy of the host point reference.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public Reference GetHostPointReference()
Visual Basic
Public Function GetHostPointReference As Reference
Visual C++
public:
Reference^ GetHostPointReference()
See Also
PointRelativeToPoint Class
Autodesk.Revit.DB Namespace